bariscan-kose/Projects-Assignments/ESP32S Hospital SOSCode Microprocessor Project/Arduino/libraries/ESP-Mail-Client-master/src/ESP_Mail_Client.h
#ifndef ESP_Mail_Client_H
#define ESP_Mail_Client_H

#define ESP_MAIL_VERSION "1.3.1"


/**
 * Mail Client Arduino Library for Espressif's ESP32 and ESP8266 , SAMD21 and Raspberry Pi's RP2040 with u-blox NINA-W102 WiFi/Bluetooth module
 * 
 *   Version:   1.3.1
 *   Released:  June 27, 2021
 *
 *   Updates:
 * - Fix missing line break for pre-encoded base64 content encoding attachment.
 * - Add camera image sending Email example.
 * 
 * 
 * This library allows Espressif's ESP32 and ESP8266 devices to send and read
 * Email
 * through the SMTP and IMAP servers.
 *
 * The MIT License (MIT)
 * Copyright (c) 2021 K. Suwatchai (Mobizt)
 *
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies
 * of
 * the Software, and to permit persons to whom the Software is furnished to do
 * so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS
 * OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
 * WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/

#include <Arduino.h>
#include "extras/RFC2047.h"
#include "extras/ESPTimeHelper/ESPTimeHelper.h"
#include <time.h>

#if defined(ESP32) || defined(ESP8266)

#define UPLOAD_CHUNKS_NUM 12
#define ESP_MAIL_PRINTF Serial.printf
#include <SD.h>

#if defined(ESP32)

#define FORMAT_FLASH FORMAT_FLASH_IF_MOUNT_FAILED
#include <WiFi.h>
#include <FS.h>
#include <SPIFFS.h>
#include <ETH.h>
#include "wcs/esp32/ESP32_TCP_Client.h"
#define WCS_CLIENT ESP32_WCS
#define TCP_CLIENT ESP32_TCP_Client
#define ESP_MAIL_MIN_MEM 70000

#elif defined(ESP8266)

#include <ESP8266WiFi.h>
#define FS_NO_GLOBALS
#include <FS.h>
#include "wcs/esp8266/ESP8266_TCP_Client.h"
#define WCS_CLIENT ESP8266_WCS
#define TCP_CLIENT ESP8266_TCP_Client
#define ESP_MAIL_MIN_MEM 4000
#define SD_CS_PIN 15

#endif

#elif defined(ARDUINO_ARCH_SAMD) 
#undef min
#undef max
#define UPLOAD_CHUNKS_NUM 5
#define ESP_MAIL_MIN_MEM 3000

#include <algorithm>
#include <SPI.h>
#include "extras/SD/SD.h"
#include "wcs/samd/WiFiNINA_TCP_Client.h"
#define WCS_CLIENT WiFiSSLClient
#define TCP_CLIENT WiFiNINA_TCP_Client
#include "extras/print/printf.h"

extern "C" __attribute__((weak)) void _putchar(char c)
{
  Serial.print(c);
}

#define ESP_MAIL_PRINTF printf

#ifdef __arm__
// should use uinstd.h to define sbrk but Due causes a conflict
extern "C" char *sbrk(int incr);
#else  // __ARM__
extern char *__brkval;
#endif // __arm__

#endif

#include <vector>
#include <strings.h>
#include "extras/MIMEInfo.h"


#define SMTP_STATUS_SERVER_CONNECT_FAILED -100
#define SMTP_STATUS_SMTP_GREETING_GET_RESPONSE_FAILED -101
#define SMTP_STATUS_SMTP_GREETING_SEND_ACK_FAILED -102
#define SMTP_STATUS_AUTHEN_NOT_SUPPORT -103
#define SMTP_STATUS_AUTHEN_FAILED -104
#define SMTP_STATUS_USER_LOGIN_FAILED -105
#define SMTP_STATUS_PASSWORD_LOGIN_FAILED -106
#define SMTP_STATUS_SEND_HEADER_SENDER_FAILED -107
#define SMTP_STATUS_SEND_HEADER_RECIPIENT_FAILED -108
#define SMTP_STATUS_SEND_BODY_FAILED -109
#define SMTP_STATUS_SERVER_OAUTH2_LOGIN_DISABLED -110
#define SMTP_STATUS_NO_VALID_RECIPIENTS_EXISTED -111
#define SMTP_STATUS_NO_VALID_SENDER_EXISTED -112
#define SMTP_STATUS_NO_SUPPORTED_AUTH -113

#define IMAP_STATUS_SERVER_CONNECT_FAILED -200
#define IMAP_STATUS_IMAP_RESPONSE_FAILED -201
#define IMAP_STATUS_LOGIN_FAILED -202
#define IMAP_STATUS_BAD_COMMAND -203
#define IMAP_STATUS_PARSE_FLAG_FAILED -204
#define IMAP_STATUS_SERVER_OAUTH2_LOGIN_DISABLED -205
#define IMAP_STATUS_NO_MESSAGE -206
#define IMAP_STATUS_ERROR_DOWNLAD_TIMEOUT -207
#define IMAP_STATUS_CLOSE_MAILBOX_FAILED -208
#define IMAP_STATUS_OPEN_MAILBOX_FAILED -209
#define IMAP_STATUS_LIST_MAILBOXS_FAILED -210
#define IMAP_STATUS_CHECK_CAPABILITIES_FAILED -211
#define IMAP_STATUS_NO_SUPPORTED_AUTH -212
#define IMAP_STATUS_NO_MAILBOX_FOLDER_OPENED -213


#define MAIL_CLIENT_ERROR_CONNECTION_CLOSED -28
#define MAIL_CLIENT_ERROR_READ_TIMEOUT -29
#define MAIL_CLIENT_ERROR_FILE_IO_ERROR -30
#define MAIL_CLIENT_ERROR_SERVER_CONNECTION_FAILED -31
#define MAIL_CLIENT_ERROR_SSL_TLS_STRUCTURE_SETUP -32
#define MAIL_CLIENT_ERROR_OUT_OF_MEMORY -33

#define MAX_EMAIL_SEARCH_LIMIT 1000
#define BASE64_CHUNKED_LEN 76
#define FLOWED_TEXT_LEN 78
#define ESP_MAIL_WIFI_RECONNECT_TIMEOUT 10000
#define ESP_MAIL_PROGRESS_REPORT_STEP 20
#define ESP_MAIL_CLIENT_TRANSFER_DATA_FAILED 0
#define ESP_MAIL_CLIENT_STREAM_CHUNK_SIZE 256
#define ESP_MAIL_CLIENT_VALID_TS 1577836800


class IMAPSession;
class SMTPSession;
class SMTP_Status;
class DownloadProgress;
class MessageData;

enum esp_mail_smtp_status_code
{
  esp_mail_smtp_status_code_0, // default

  /* Positive Completion */
  esp_mail_smtp_status_code_211 = 221, // System status, or system help reply
  esp_mail_smtp_status_code_214 = 214, // Help message(A response to the HELP command)
  esp_mail_smtp_status_code_220 = 220, //<domain> Service ready
  esp_mail_smtp_status_code_221 = 221, //<domain> Service closing transmission channel [RFC 2034]
  esp_mail_smtp_status_code_235 = 235, // 2.7.0 Authentication succeeded[RFC 4954]
  esp_mail_smtp_status_code_250 = 250, // Requested mail action okay, completed
  esp_mail_smtp_status_code_251 = 251, // User not local; will forward
  esp_mail_smtp_status_code_252 = 252, // Cannot verify the user, but it will
                                       // try to deliver the message anyway

  /* Positive Intermediate */
  esp_mail_smtp_status_code_334 = 334, //(Server challenge - the text part
                                       //contains the Base64 - encoded
                                       //challenge)[RFC 4954]
  esp_mail_smtp_status_code_354 = 354, // Start mail input

  /* Transient Negative Completion */
  /* "Transient Negative" means the error condition is temporary, and the action
     may be requested again.*/
  esp_mail_smtp_status_code_421 = 421, // Service is unavailable because the server is shutting down.
  esp_mail_smtp_status_code_432 = 432, // 4.7.12 A password transition is needed [RFC 4954]
  esp_mail_smtp_status_code_450 = 450, // Requested mail action not taken: mailbox unavailable (e.g.,
                                       // mailbox busy or temporarily blocked for policy reasons)
  esp_mail_smtp_status_code_451 = 451, // Requested action aborted : local error in processing
  // e.g.IMAP server unavailable[RFC 4468]
  esp_mail_smtp_status_code_452 = 452, // Requested action not taken : insufficient system storage
  esp_mail_smtp_status_code_454 = 454, // 4.7.0 Temporary authentication failure[RFC 4954]
  esp_mail_smtp_status_code_455 = 455, // Server unable to accommodate parameters

  /* Permanent Negative Completion */
  esp_mail_smtp_status_code_500 = 500, // Syntax error, command unrecognized
                                       // (This may include errors such as
                                       // command line too long)
  // e.g. Authentication Exchange line is too long [RFC 4954]
  esp_mail_smtp_status_code_501 = 501, // Syntax error in parameters or arguments
  // e.g. 5.5.2 Cannot Base64-decode Client responses [RFC 4954]
  // 5.7.0 Client initiated Authentication Exchange (only when the SASL
  // mechanism specified that client does not begin the authentication exchange)
  // [RFC 4954]
  esp_mail_smtp_status_code_502 = 502, // Command not implemented
  esp_mail_smtp_status_code_503 = 503, // Bad sequence of commands
  esp_mail_smtp_status_code_504 = 504, // Command parameter is not implemented
  // e.g. 5.5.4 Unrecognized authentication type [RFC 4954]
  esp_mail_smtp_status_code_521 = 521, // Server does not accept mail [RFC 7504]
  esp_mail_smtp_status_code_523 = 523, // Encryption Needed [RFC 5248]
  esp_mail_smtp_status_code_530 = 530, // 5.7.0 Authentication required [RFC 4954]
  esp_mail_smtp_status_code_534 = 534, // 5.7.9 Authentication mechanism is too weak [RFC 4954]
  esp_mail_smtp_status_code_535 = 535, // 5.7.8 Authentication credentials invalid [RFC 4954]
  esp_mail_smtp_status_code_538 = 538, // 5.7.11 Encryption required for
                                       // requested authentication mechanism[RFC
                                       // 4954]
  esp_mail_smtp_status_code_550 = 550, // Requested action not taken: mailbox unavailable (e.g., mailbox not
                                       // found, no access, or command rejected for policy reasons)
  esp_mail_smtp_status_code_551 = 551, // User not local; please try <forward-path>
  esp_mail_smtp_status_code_552 = 552, // Requested mail action aborted: exceeded storage allocation
  esp_mail_smtp_status_code_553 = 553, // Requested action not taken: mailbox name not allowed
  esp_mail_smtp_status_code_554 = 554, // Transaction has failed (Or, in the
                                       // case of a connection-opening response,
                                       // "No SMTP service here")
  // e.g. 5.3.4 Message too big for system [RFC 4468]
  esp_mail_smtp_status_code_556 = 556, // Domain does not accept mail[RFC 7504]
};

enum esp_mail_smtp_port
{
  esp_mail_smtp_port_25 = 25,   // PLAIN/TLS with STARTTLS
  esp_mail_smtp_port_465 = 465, // SSL
  esp_mail_smtp_port_587 = 587  // TLS with STARTTLS
};

