bariscan-kose/Projects-Assignments/ESP32S Hospital SOSCode Microprocessor Project/Arduino/libraries/ESP-Mail-Client-master/src/ESP_Mail_Client.h
enum esp_mail_imap_port
{
  esp_mail_imap_port_143 = 143, // PLAIN/TLS with STARTTLS
  esp_mail_imap_port_993 = 993, // SSL
};

enum esp_mail_smtp_notify
{
  esp_mail_smtp_notify_never = 0,
  esp_mail_smtp_notify_success = 1,
  esp_mail_smtp_notify_failure = 2,
  esp_mail_smtp_notify_delay = 4
};

enum esp_mail_attach_type
{
  esp_mail_att_type_none,
  esp_mail_att_type_attachment,
  esp_mail_att_type_inline
};

enum esp_mail_message_type
{
  esp_mail_msg_type_none = 0,
  esp_mail_msg_type_plain = 1,
  esp_mail_msg_type_html = 2,
  esp_mail_msg_type_enriched = 1
};

enum esp_mail_auth_type
{
  esp_mail_auth_type_psw,
  esp_mail_auth_type_oath2,
  esp_mail_auth_type_token
};

enum esp_mail_imap_auth_mode
{
  esp_mail_imap_mode_examine,
  esp_mail_imap_mode_select
};

enum esp_mail_imap_response_status
{
  esp_mail_imap_resp_unknown,
  esp_mail_imap_resp_ok,
  esp_mail_imap_resp_no,
  esp_mail_imap_resp_bad
};

enum esp_mail_imap_header_state
{
  esp_mail_imap_state_from = 1,
  esp_mail_imap_state_to,
  esp_mail_imap_state_cc,
  esp_mail_imap_state_subject,
  esp_mail_imap_state_content_type,
  esp_mail_imap_state_content_transfer_encoding,
  esp_mail_imap_state_accept_language,
  esp_mail_imap_state_content_language,
  esp_mail_imap_state_date,
  esp_mail_imap_state_msg_id,
  esp_mail_imap_state_char_set,
  esp_mail_imap_state_boundary
};

enum esp_mail_imap_command
{
  esp_mail_imap_cmd_capability,
  esp_mail_imap_cmd_starttls,
  esp_mail_imap_cmd_login,
  esp_mail_imap_cmd_plain,
  esp_mail_imap_cmd_auth,
  esp_mail_imap_cmd_list,
  esp_mail_imap_cmd_select,
  esp_mail_imap_cmd_examine,
  esp_mail_imap_cmd_close,
  esp_mail_imap_cmd_status,
  esp_mail_imap_cmd_search,
  esp_mail_imap_cmd_fetch_body_header,
  esp_mail_imap_cmd_fetch_body_mime,
  esp_mail_imap_cmd_fetch_body_text,
  esp_mail_imap_cmd_fetch_body_attachment,
  esp_mail_imap_cmd_fetch_body_inline,
  esp_mail_imap_cmd_logout,
  esp_mail_imap_cmd_store,
  esp_mail_imap_cmd_expunge,
  esp_mail_imap_cmd_create,
  esp_mail_imap_cmd_delete
};

enum esp_mail_imap_mime_fetch_type
{
  esp_mail_imap_mime_fetch_type_part,
  esp_mail_imap_mime_fetch_type_sub_part1,
  esp_mail_imap_mime_fetch_type_sub_part2
};

enum esp_mail_smtp_command
{
  esp_mail_smtp_cmd_initial_state,
  esp_mail_smtp_cmd_greeting,
  esp_mail_smtp_cmd_start_tls,
  esp_mail_smtp_cmd_login_user,
  esp_mail_smtp_cmd_auth_plain,
  esp_mail_smtp_cmd_auth,
  esp_mail_smtp_cmd_login_psw,
  esp_mail_smtp_cmd_send_header_sender,
  esp_mail_smtp_cmd_send_header_recipient,
  esp_mail_smtp_cmd_send_body,
  esp_mail_smtp_cmd_chunk_termination,
  esp_mail_smtp_cmd_logout
};

enum esp_mail_imap_header_type
{
  esp_mail_imap_header_from,
  esp_mail_imap_header_to,
  esp_mail_imap_header_cc,
  esp_mail_imap_header_subject,
  esp_mail_imap_header_date,
  esp_mail_imap_header_msg_id,
  esp_mail_imap_header_cont_lang,
  esp_mail_imap_header_accept_lang
};

enum esp_mail_char_decoding_scheme
{
  esp_mail_char_decoding_scheme_default,
  esp_mail_char_decoding_scheme_iso8859_1,
  esp_mail_char_decoding_scheme_tis620
};

enum esp_mail_smtp_priority
{
  esp_mail_smtp_priority_high = 1,
  esp_mail_smtp_priority_normal = 3,
  esp_mail_smtp_priority_low = 5,
};

enum esp_mail_smtp_embed_message_type
{
  esp_mail_smtp_embed_message_type_attachment = 0,
  esp_mail_smtp_embed_message_type_inline
};

enum esp_mail_debug_level
{
  esp_mail_debug_level_0 = 0,
  esp_mail_debug_level_1,
  esp_mail_debug_level_2 = 222,
  esp_mail_debug_level_3 = 333
};

enum esp_mail_imap_multipart_sub_type
{
  esp_mail_imap_multipart_sub_type_none = 0,
  esp_mail_imap_multipart_sub_type_mixed,
  esp_mail_imap_multipart_sub_type_alternative,
  esp_mail_imap_multipart_sub_type_parallel,
  esp_mail_imap_multipart_sub_type_digest,
  esp_mail_imap_multipart_sub_type_related,
  esp_mail_imap_multipart_sub_type_report,
};

enum esp_mail_imap_message_sub_type
{
  esp_mail_imap_message_sub_type_none = 0,
  esp_mail_imap_message_sub_type_rfc822,
  esp_mail_imap_message_sub_type_delivery_status,
  esp_mail_imap_message_sub_type_partial,
  esp_mail_imap_message_sub_type_external_body,
};

/* descrete media types (rfc 2046) */
struct esp_mail_imap_descrete_media_type_t
{
  /** textual information with subtypes
   * "plain"
   * "enriched" (rfc 1896 revised from richtext in rfc 1341)
   *
   * unrecognized subtypes and charset should be interpreted as
   * application/octet-stream
   *
   * parameters:
   * "charset" (rfc 2045) default is us-ascii
   * for character set includes 8-bit characters
   * and such characters are used in the body, Content-Transfer-Encoding
   * header field and a corresponding encoding on the data are required
   *
   * ISO-8859-X where "X" is to be replaced, as
   * necessary, for the parts of ISO-8859 [ISO-8859].
  */
  static constexpr const char *text = "text";

  /** image data with subtypes (rfc 2048)
   * "jpeg"
   * "gif"
   *
   * unrecognized subtypes should be interpreted as application/octet-stream
  */
  static constexpr const char *image = "image";

  /** audio data with initial subtype
   * "baic" -- for single channel audio encoded using 8bit ISDN mu-law [PCM]
   * at a sample rate of 8000 Hz.
   *
   * Unrecognized subtypes of "audio" should at a miniumum be treated as
   * "application/octet-stream"
  */
  static constexpr const char *audio = "audio";

  /** video data with initial subtype
   * "mpeg"
   *
   * Unrecognized subtypes of "video" should at a minumum be treated as
   * "application/octet-stream"
  */
  static constexpr const char *video = "video";

  /** some other kind of data, typically either
   * uninterpreted binary data or information to be
   * processed by an application with subtypes
   *
   * "octet-stream" -- uninterpreted binary data
   * "PostScript" -- for the transport of PostScript material
   *
   * Other expected uses include spreadsheets, data for mail-based
   * scheduling systems, and languages for "active" (computational)
   * messaging, and word processing formats that are not directly readable.
   *
   * The octet-stream subtype parameters:
   * TYPE, PADDING, NAME
  */
  static constexpr const char *application = "application";
};

