bariscan-kose/Projects-Assignments/ESP32S Hospital SOSCode Microprocessor Project/Arduino/libraries/ESP-Mail-Client-master/src/ESP_Mail_Client.h
/** composite media types (rfc 2046)
 *
 * As stated in the definition of the Content-Transfer-Encoding field
 * [RFC 2045], no encoding other than "7bit", "8bit", or "binary" is
 * permitted for entities of type "multipart".  The "multipart" boundary
 * delimiters and header fields are always represented as 7bit US-ASCII
 * in any case (though the header fields may encode non-US-ASCII header
 * text as per RFC 2047) and data within the body parts can be encoded
 * on a part-by-part basis, with Content-Transfer-Encoding fields for
 * each appropriate body part.
*/
struct esp_mail_imap_composite_media_type_t
{
  /** data consisting of multiple entities of independent data types
   * The Content-Type field for multipart entities requires one parameter,
   * "boundary".
   * The boundary delimiter line is then defined as a line
   * consisting entirely of two hyphen characters ("-", decimal value 45)
   * followed by the boundary parameter value from the Content-Type header
   * field, optional linear whitespace, and a terminating CRLF.
   *
   * NOTE: The CRLF preceding the boundary delimiter line is conceptually
   * attached to the boundary so that it is possible to have a part that
   * does not end with a CRLF (line  break).  Body parts that must be
   * considered to end with line breaks, therefore, must have two CRLFs
   * preceding the boundary delimiter line, the first of which is part of
   * the preceding body part, and the second of which is part of the
   * encapsulation boundary.
   *
   * Boundary delimiters must not appear within the encapsulated material,
   * and must be no longer than 70 characters, not counting the two
   * leading hyphens.
   *
   * The boundary delimiter line following the last body part is a
   * distinguished delimiter that indicates that no further body parts
   * will follow.  Such a delimiter line is identical to the previous
   * delimiter lines, with the addition of two more hyphens after the
   * boundary parameter value.
   *
   * See rfc2049 Appendix A for a Complex Multipart Example
  */
  static constexpr const char *multipart = "multipart";

  /* an encapsulated message */
  static constexpr const char *message = "message";
};

struct esp_mail_imap_media_text_sub_type_t
{
  static constexpr const char *plain = "plain";
  static constexpr const char *enriched = "enriched";
  static constexpr const char *html = "html";
};

/* multipart sub types */
struct esp_mail_imap_multipart_sub_type_t
{
  /* a generic mixed set of parts */
  static constexpr const char *mixed = "mixed";

  /* the same data in multiple formats */
  static constexpr const char *alternative = "alternative";

  /* parts intended to be viewed simultaneously */
  static constexpr const char *parallel = "parallel";

  /* multipart entities in which each part has a default type of
   * "message/rfc822" */
  static constexpr const char *digest = "digest";

  /* for compound objects consisting of several inter-related body parts (rfc
   * 2387) */
  static constexpr const char *related = "related";

  /* rfc 3462 */
  static constexpr const char *report = "report";
};

/* message body sub types */
struct esp_mail_imap_message_sub_type_t
{
  /* body contains  an encapsulated message, with the syntax of an RFC 822
   * message. */
  static constexpr const char *rfc822 = "rfc822";

  /* to allow large objects to be delivered as several separate pieces of mail
   */
  static constexpr const char *Partial = "Partial";

  /* the actual body data are not included, but merely referenced */
  static constexpr const char *External_Body = "External-Body";

  static constexpr const char *delivery_status = "delivery-status";
};

/** content disposition rfc 2183
 *
 * Parameters:
 * "filename", "creation-date","modification-date",
 * "read-date", * "size"
*/
struct esp_mail_imap_content_disposition_type_t
{
  /** if it is intended to be displayed automatically
   * upon display of the message.
  */
  static constexpr const char *inline_ = "inline";

  /** to indicate that they are separate from the main body
   * of the mail message, and that their display should not
   * be automatic, but contingent upon some further action of the user.
  */
  static constexpr const char *attachment = "attachment";
};

struct esp_mail_internal_use_t
{
  bool binary = false;
  std::string cid;
};

struct esp_mail_content_transfer_encoding_t
{
  /* The default 7-bit transfer encoding for US-ACII characters*/
  static constexpr const char *enc_7bit = "7bit";

  /* The quoted printable transfer encoding for non-US-ASCII characters*/
  static constexpr const char *enc_qp = "quoted-printable";

  /* The base64 encoded transfer encoding */
  static constexpr const char *enc_base64 = "base64";

  /* The 8-bit transfer encoding for extended-US-ASCII characters*/
  static constexpr const char *enc_8bit = "8bit";

  /* The binary transfer encoding for extended-US-ASCII characters with no line
   * length limit*/
  static constexpr const char *enc_binary = "binary";
};

struct esp_mail_smtp_response_status_t
{
  int respCode = 0;
  int statusCode = 0;
  std::string text;
};

struct esp_mail_imap_response_status_t
{
  int statusCode = 0;
  std::string text;
};

/* The option to embed this message content as a file */
struct esp_mail_smtp_embed_message_body_t
{
  /* Enable to send this message body as file */
  bool enable = false;

  /* The name of embedded file */
  const char *filename = "";

  /** The embedded type
   * esp_mail_smtp_embed_message_type_attachment or 0
   * esp_mail_smtp_embed_message_type_inline or 1
  */
  esp_mail_smtp_embed_message_type type = esp_mail_smtp_embed_message_type_attachment;
};


struct esp_mail_file_message_content_t
{
  /* The file path include its name */
  const char *name = "";

  /** The type of file storages e.g.
   * esp_mail_file_storage_type_none,
   * esp_mail_file_storage_type_flash, and
   * esp_mail_file_storage_type_sd
  */
  esp_mail_file_storage_type type = esp_mail_file_storage_type_flash;
};

struct esp_mail_blob_message_content_t
{
  /* The array of content in flash memory */
  const uint8_t *data = nullptr;

  /* The array size in bytes */
  size_t size = 0;
};

/* The PLAIN text body details of the message */
struct esp_mail_plain_body_t
{
  /* The option to embed this message content as a file */
  struct esp_mail_smtp_embed_message_body_t embed;

  /* The PLAIN text content of the message */
  const char *content = "";

  /* The blob that contins PLAIN text content of the message */
  struct esp_mail_blob_message_content_t blob;

  /* The file that contins PLAIN text content of the message */
  struct esp_mail_file_message_content_t file;

  /* The charset of the PLAIN text content of the message */
  const char *charSet = "UTF-8";

  /* The content type of message */
  const char *content_type = "text/plain";

  /* The option to encode the content for data transfer */
  const char *transfer_encoding = "7bit";

