bariscan-kose/Projects-Assignments/ESP32S Hospital SOSCode Microprocessor Project/Arduino/libraries/ESP-Mail-Client-master/src/ESP_Mail_Client.h
  /* The option to send the PLAIN text with wrapping */
  bool flowed = false;

  /* The internal usage data */
  struct esp_mail_internal_use_t _int;
};

struct esp_mail_html_body_t
{
  /* The option to embedded the content as a file */
  struct esp_mail_smtp_embed_message_body_t embed;

  /* The HTML content of the message */
  const char *content = "";

  /* The blob that contins HTML content of the message */
  struct esp_mail_blob_message_content_t blob;

  /* The file that contins HTML content of the message */
  struct esp_mail_file_message_content_t file;

  /* The charset of the HTML content of the message */
  const char *charSet = "UTF-8";

  /* The content type of message */
  const char *content_type = "text/html";

  /* The option to encode the content for data transfer */
  const char *transfer_encoding = "7bit";

  /* The internal usage data */
  struct esp_mail_internal_use_t _int;
};

struct esp_mail_link_internal_t
{
  std::string cid;
};

struct esp_mail_email_info_t
{
  /* The name of Email author*/
  const char *name = "";

  /* The Email address */
  const char *email = "";
};
struct esp_mail_smtp_msg_response_t
{
  /* The author Email address to reply */
  const char *reply_to = "";

  /* The sender Email address to return the message */
  const char *return_path = "";

  /** The Delivery Status Notifications e.g. esp_mail_smtp_notify_never,
   * esp_mail_smtp_notify_success,
   * esp_mail_smtp_notify_failure, and
   * esp_mail_smtp_notify_delay
  */
  int notify = esp_mail_smtp_notify::esp_mail_smtp_notify_never;
};

struct esp_mail_smtp_enable_option_t
{
  /* Enable chunk data sending for large message */
  bool chunking = false;
};

struct esp_mail_attach_blob_t
{
  /* BLOB data (flash or ram) */
  const uint8_t *data = nullptr;

  /* BLOB data size in byte */
  size_t size = 0;
};

struct esp_mail_attach_file_t
{
  const char *path = "";
  /** The file storage type e.g. esp_mail_file_storage_type_none,
   * esp_mail_file_storage_type_flash, and
   * esp_mail_file_storage_type_sd
  */
  esp_mail_file_storage_type storage_type = esp_mail_file_storage_type_none;
};

struct esp_mail_attach_descr_t
{
  /* The name of attachment */
  const char *name = "";

  /* The attachment file name */
  const char *filename = "";

  /* The MIME type of attachment */
  const char *mime = "";

  /* The transfer encoding of attachment e.g. base64 */
  const char *transfer_encoding = "base64";

  /* The content encoding of attachment e.g. base64 */
  const char *content_encoding = "";

  /* The content id of attachment file */
  const char *content_id = "";
};

struct esp_mail_attach_internal_t
{
  esp_mail_attach_type att_type = esp_mail_att_type_attachment;
  int index = 0;
  int msg_uid = 0;
  bool flash_blob = false;
  bool binary = false;
  bool parallel = false;
  std::string cid;
};

struct esp_mail_attachment_t
{
  /* The attachment description */
  struct esp_mail_attach_descr_t descr;

  /* The BLOB data config */
  struct esp_mail_attach_blob_t blob;

  /* The file data config */
  struct esp_mail_attach_file_t file;

  /* reserved for internal usage */
  struct esp_mail_attach_internal_t _int;
};

struct esp_mail_smtp_recipient_t
{
  /* The recipient's name */
  const char *name = "";

  /* The recipient's Email address */
  const char *email = "";
};

struct esp_mail_smtp_recipient_address_t
{
  /* The recipient's Email address */
  const char *email = "";
};

struct esp_mail_smtp_send_status_t
{
  /* The status of the message */
  bool completed = false;

  /* The primary recipient mailbox of the message */
  const char *recipients = "";

  /* The topic of the message */
  const char *subject = "";

  /* The timestamp of the message */
  uint32_t timestamp = 0;
};

struct esp_mail_attacment_info_t
{
  const char *filename = "";
  const char *name = "";
  const char *creationDate = "";
  const char *mime = "";
  esp_mail_attach_type type = esp_mail_att_type_none;
  size_t size;
};

struct esp_mail_auth_capability_t
{
  bool plain = false;
  bool xoauth2 = false;
  bool cram_md5 = false;
  bool digest_md5 = false;
  bool login = false;
  bool start_tls = false;
};

struct esp_mail_smtp_capability_t
{
  bool esmtp = false;
  bool binaryMIME = false;
  bool _8bitMIME = false;
  bool chunking = false;
  bool utf8 = false;
  bool pipelining = false;
  bool dsn = false;
};

struct esp_mail_imap_rfc822_msg_header_item_t
{
  std::string sender;
  std::string from;
  std::string subject;
  std::string messageID;
  std::string keyword;
  std::string comment;
  std::string date;
  std::string return_path;
  std::string reply_to;
  std::string to;
  std::string cc;
  std::string bcc;
};

struct esp_mail_message_part_info_t
{
  int octetLen = 0;
  int attach_data_size = 0;
  int textLen = 0;
  bool sizeProp = false;
  int nestedLevel = 0;
  std::string partNumStr;
  std::string partNumFetchStr;
  std::string text;
  std::string filename;
  std::string type;
  std::string save_path;
  std::string name;
  std::string content_disposition;
  std::string content_type;
  std::string descr;
  std::string content_transfer_encoding;
  std::string creation_date;
  std::string modification_date;
  std::string charset;
  std::string download_error;
  esp_mail_attach_type attach_type = esp_mail_att_type_none;
  esp_mail_message_type msg_type = esp_mail_msg_type_none;
  bool file_open_write = false;
  bool multipart = false;
  esp_mail_imap_multipart_sub_type multipart_sub_type = esp_mail_imap_multipart_sub_type_none;
  esp_mail_imap_message_sub_type message_sub_type = esp_mail_imap_message_sub_type_none;
  bool rfc822_part = false;
  int rfc822_msg_Idx = 0;
  struct esp_mail_imap_rfc822_msg_header_item_t rfc822_header;
  bool error = false;
  bool plain_flowed = false;
  bool plain_delsp = false;
};

struct esp_mail_message_header_t
{
  int header_data_len = 0;
  std::string from;
  std::string to;
  std::string cc;
  std::string subject;
  std::string content_type;
  std::string content_transfer_encoding;
  std::string date;
  std::string message_id;
  std::string message_uid;
  std::string message_no;
  std::string boundary;
  std::string accept_language;
  std::string content_language;
  std::string char_set;
  bool multipart = false;
  bool rfc822_part = false;
  int rfc822Idx = 0;
  std::string partNumStr;

  esp_mail_imap_multipart_sub_type multipart_sub_type = esp_mail_imap_multipart_sub_type_none;
  esp_mail_imap_message_sub_type message_sub_type = esp_mail_imap_message_sub_type_none;
  std::string from_charset;
  std::string to_charset;
  std::string cc_charset;
  std::string subject_charset;
  std::string msgID;
  std::string error_msg;
  bool error = false;
  std::vector<struct esp_mail_message_part_info_t> part_headers = std::vector<struct esp_mail_message_part_info_t>();
  int attachment_count = 0;
  int total_download_size = 0;
  int downloaded_size = 0;
  int total_attach_data_size = 0;
  int downloaded_bytes = 0;
  int message_data_count = 0;
};

/* Internal use */
struct esp_mail_folder_info_t
{
  std::string name;
  std::string attributes;
  std::string delimiter;
};

struct esp_mail_folder_info_item_t
{
  /* The name of folder */
  const char *name = "";

  /* The attributes of folder */
  const char *attributes = "";

  /* The delimeter of folder */
  const char *delimiter = "";
};

struct esp_mail_sesson_cert_config_t
{
  /* The certificate data (base64 data) */
  const char *cert_data = "";

