bariscan-kose/Projects-Assignments/ESP32S Hospital SOSCode Microprocessor Project/Arduino/libraries/ESP-Mail-Client-master/src/ESP_Mail_Client.h
  /* The certificate file (DER format) */
  const char *cert_file = "";

  /* The storage type */
  esp_mail_file_storage_type cert_file_storage_type;

  /* The cerificate verification option */
  bool verify = false;
};

struct esp_mail_sesson_sever_config_t
{
  /* The hostName of the server */
  const char *host_name = "";
  /* The port on the server to connect to */
  uint16_t port = 0;
};

/* The log in credentials */
struct esp_mail_sesson_login_config_t
{
  /* The user Email address to log in */
  const char *email = "";

  /* The user password to log in */
  const char *password = "";

  /* The OAuth2.0 access token to log in */
  const char *accessToken = "";

  /* The user domain or ip of client */
  const char *user_domain = "";
};

struct esp_mail_sesson_secure_config_t
{
  /* The option to send the command to start the TLS connection */
  bool startTLS = false;
};

struct esp_mail_session_config_t
{
  /* The server config */
  struct esp_mail_sesson_sever_config_t server;

  /* The log in config */
  struct esp_mail_sesson_login_config_t login;

  /* The secure config */
  struct esp_mail_sesson_secure_config_t secure;

  /* The certificate config */
  struct esp_mail_sesson_cert_config_t certificate;
};

struct esp_mail_imap_download_config_t
{
  /* To download the PLAIN text content of the message */
  bool text = false;

  /* To download the HTML content of the message */
  bool html = false;

  /* To download the attachments of the message */
  bool attachment = false;

  /* To download the inline image of the message */
  bool inlineImg = false;

  /* To download the rfc822 mesages in the message */
  bool rfc822 = false;

  /* To download the message header */
  bool header = false;
};

struct esp_mail_imap_enable_config_t
{
  /* To store the PLAIN text of the message in the IMAPSession */
  bool text = false;

  /* To store the HTML of the message in the IMAPSession */
  bool html = false;

  /* To store the rfc822 messages in the IMAPSession */
  bool rfc822 = false;

  /* To enable the download status via the serial port */
  bool download_status = false;

  /* To sort the message UID of the search result in descending order */
  bool recent_sort = false;
};

struct esp_mail_imap_limit_config_t
{
  /* The maximum messages from the search result */
  size_t search = 10;

  /** The maximum size of the memory buffer to store the message content.
   * This is only limit for data to be stored in the IMAPSession.
  */
  size_t msg_size = 1024;

  /* The maximum size of each attachment to download */
  size_t attachment_size = 1024 * 1024 * 5;
};

struct esp_mail_imap_storage_config_t
{
  /* The path to save the downloaded file */
  const char *saved_path = "/";

  /** The type of file storages e.g.
   * esp_mail_file_storage_type_none,
   * esp_mail_file_storage_type_flash, and
   * esp_mail_file_storage_type_sd
  */
  esp_mail_file_storage_type type = esp_mail_file_storage_type_flash;
};

struct esp_mail_imap_search_config_t
{
  /* The search criteria */
  const char *criteria = "";

  /* The option to search the unseen message */
  bool unseen_msg = false;
};

struct esp_mail_imap_fetch_config_t
{
  /* The UID of message to fetch */
  const char *uid = "";

  /* Set the message flag as seen */
  bool set_seen = false;
};

struct esp_mail_imap_read_config_t
{
  /* The config for fetching */
  struct esp_mail_imap_fetch_config_t fetch;

  /* The config for search */
  struct esp_mail_imap_search_config_t search;

  /* The config about the limits */
  struct esp_mail_imap_limit_config_t limit;

  /* The config to enable the features */
  struct esp_mail_imap_enable_config_t enable;

  /* The config about downloads */
  struct esp_mail_imap_download_config_t download;

  /* The config about the storage and path to save the downloaded file */
  struct esp_mail_imap_storage_config_t storage;
};

/* Mail and MIME Header Fields */
struct esp_mail_imap_msg_item_t
{
  /* The message number */
  const char *msgNo = "";

  /* The message UID */
  const char *UID = "";

  /* The message identifier (RFC 4021) */
  const char *ID = "";

  /* The language(s) for auto-responses (RFC 4021) */
  const char *acceptLang = "";

  /* The language of message content (RFC 4021) */
  const char *contentLang = "";

  /* The mailbox of message author (RFC 4021) */
  const char *from = "";

  /* The charset of the mailbox of message author */
  const char *fromCharset = "";

  /* The primary recipient mailbox (RFC 4021) */
  const char *to = "";

  /* The charset of the primary recipient mailbox */
  const char *toCharset = "";

  /* The Carbon-copy recipient mailboxes (RFC 4021) */
  const char *cc = "";

  /* The charset of the Carbon-copy recipient mailbox header */
  const char *ccCharset = "";

  /* The message date and time (RFC 4021) */
  const char *date = "";

  /* The topic of message (RFC 4021) */
  const char *subject = "";

  /* The topic of message charset */
  const char *subjectCharset = "";

  /* The PLAIN text content of the message */
  struct esp_mail_plain_body_t text;

  /* The HTML content of the message */
  struct esp_mail_html_body_t html;

  /* rfc822 related */

  /* The sender Email  */
  const char *sender;

  /* The message identifier */
  const char *messageID = "";

  /* The keywords or phrases, separated by commas */
  const char *keyword = "";

  /* The comment about message */
  const char *comment = "";

  /* The return recipient of the message */
  const char *return_path = "";

  /* The Email address to reply */
  const char *reply_to;

  /* The Blind carbon-copy recipients */
  const char *bcc = "";

  /* The error description from fetching the message */
  const char *fetchError = "";

  /* The info about the attachments in the message */
  std::vector<struct esp_mail_attacment_info_t> attachments = std::vector<struct esp_mail_attacment_info_t>();

  /* The info about the rfc822 messages included in the message */
  std::vector<esp_mail_imap_msg_item_t> rfc822 = std::vector<esp_mail_imap_msg_item_t>();
};

struct esp_mail_imap_msg_list_t
{
  /* The info of a message */
  std::vector<esp_mail_imap_msg_item_t> msgItems = std::vector<esp_mail_imap_msg_item_t>();
};

