bariscan-kose/Projects-Assignments/ESP32S Hospital SOSCode Microprocessor Project/Arduino/libraries/ESP-Mail-Client-master/src/ESP_Mail_Client.h
/* The SMTP message class */
class SMTP_Message
{
public:
  SMTP_Message(){};
  ~SMTP_Message() { clear(); };

  void resetAttachItem(SMTP_Attachment &att)
  {
    att.blob.size = 0;
    att.blob.data = nullptr;
    att.file.path = "";
    att.file.storage_type = esp_mail_file_storage_type_none;
    att.descr.name = "";
    att.descr.filename = "";
    att.descr.transfer_encoding = "";
    att.descr.content_encoding = "";
    att.descr.mime = "";
    att.descr.content_id = "";
    att._int.att_type = esp_mail_att_type_none;
    att._int.index = 0;
    att._int.msg_uid = 0;
    att._int.flash_blob = false;
    att._int.binary = false;
    att._int.parallel = false;
    att._int.cid.clear();
  }

  void clear()
  {
    sender.name = "";
    sender.email = "";
    subject = "";
    text.charSet = "";
    text.content = "";
    text.content_type = "";
    text.embed.enable = false;
    html.charSet = "";
    html.content = "";
    html.content_type = "";
    html.embed.enable = false;
    response.reply_to = "";
    response.notify = esp_mail_smtp_notify::esp_mail_smtp_notify_never;
    priority = esp_mail_smtp_priority::esp_mail_smtp_priority_normal;

    for (size_t i = 0; i < _rcp.size(); i++)
    {
      _rcp[i].name = "";
      _rcp[i].email = "";
    }

    for (size_t i = 0; i < _cc.size(); i++)
      _cc[i].email = "";

    for (size_t i = 0; i < _bcc.size(); i++)
      _bcc[i].email = "";

    for (size_t i = 0; i < _hdr.size(); i++)
      _hdr[i] = "";

    for (size_t i = 0; i < _att.size(); i++)
    {
      _att[i].descr.filename = "";
      _att[i].blob.data = nullptr;
      _att[i].descr.mime = "";
      _att[i].descr.name = "";
      _att[i].blob.size = 0;
      _att[i].descr.transfer_encoding = "";
      _att[i].file.path = "";
      _att[i].file.storage_type = esp_mail_file_storage_type_none;
    }

    for (size_t i = 0; i < _parallel.size(); i++)
    {
      _parallel[i].descr.filename = "";
      _parallel[i].blob.data = nullptr;
      _parallel[i].descr.mime = "";
      _parallel[i].descr.name = "";
      _parallel[i].blob.size = 0;
      _parallel[i].descr.transfer_encoding = "";
      _parallel[i].file.path = "";
      _parallel[i].file.storage_type = esp_mail_file_storage_type_none;
    }
    _rcp.clear();
    _cc.clear();
    _bcc.clear();
    _hdr.clear();
    _att.clear();
    _parallel.clear();
  }

  /** Clear all the inline images
  */
  void clearInlineimages()
  {
    for (int i = (int)_att.size() - 1; i >= 0; i--)
    {
      if (_att[i]._int.att_type == esp_mail_att_type_inline)
        _att.erase(_att.begin() + i);
    }
  };

  /* Clear all the attachments */
  void clearAttachments()
  {
    for (int i = (int)_att.size() - 1; i >= 0; i--)
    {
      if (_att[i]._int.att_type == esp_mail_att_type_attachment)
        _att.erase(_att.begin() + i);
    }

    for (int i = (int)_parallel.size() - 1; i >= 0; i--)
      _parallel.erase(_parallel.begin() + i);
  };

  /** Clear all rfc822 message attachment
  */
  void clearRFC822Messages()
  {
    for (int i = (int)_rfc822.size() - 1; i >= 0; i--)
    {
      _rfc822[i].clear();
      _rfc822.erase(_rfc822.begin() + i);
    }
  };

  /** Clear the primary recipient mailboxes
  */
  void clearRecipients() { _rcp.clear(); };

  /** Clear the Carbon-copy recipient mailboxes
  */
  void clearCc() { _cc.clear(); };

  /** Clear the Blind-carbon-copy recipient mailboxes
  */
  void clearBcc() { _bcc.clear(); };

  /** Clear the custom message headers
  */
  void clearHeader() { _hdr.clear(); };

  /** Add attachment to the message
   *
   * @param att The SMTP_Attachment data item
  */
  void addAttachment(SMTP_Attachment &att)
  {
    att._int.att_type = esp_mail_att_type_attachment;
    att._int.parallel = false;
    att._int.flash_blob = true;
    _att.push_back(att);
  };

  /** Add parallel attachment to the message
   *
   * @param att The SMTP_Attachment data item
  */
  void addParallelAttachment(SMTP_Attachment &att)
  {
    att._int.att_type = esp_mail_att_type_attachment;
    att._int.parallel = true;
    att._int.flash_blob = true;
    _parallel.push_back(att);
  };

  /** Add inline image to the message
   *
   * @param att The SMTP_Attachment data item
  */
  void addInlineImage(SMTP_Attachment &att)
  {
    att._int.flash_blob = true;
    att._int.parallel = false;
    att._int.att_type = esp_mail_att_type_inline;
    char *tmp = new char[36];
    memset(tmp, 0, 36);
    itoa(random(10000000, 20000000), tmp, 10);
    att._int.cid = tmp;
    delete[] tmp;
    _att.push_back(att);
  };

  /** Add rfc822 message to the message
   *
   * @param msg The RFC822_Message class object
  */
  void addMessage(SMTP_Message &msg) { _rfc822.push_back(msg); }

  /** Add the primary recipient mailbox to the message
   *
   * @param name The name of primary recipient
   * @param email The Email address of primary recipient
  */
  void addRecipient(const char *name, const char *email)
  {
    struct esp_mail_smtp_recipient_t rcp;
    rcp.name = name;
    rcp.email = email;
    _rcp.push_back(rcp);
  };

  /** Add Carbon-copy recipient mailbox
   *
   * @param email The Email address of the secondary recipient
  */
  void addCc(const char *email)
  {
    struct esp_mail_smtp_recipient_address_t cc;
    cc.email = email;
    _cc.push_back(cc);
  };

  /** Add Blind-carbon-copy recipient mailbox
   *
   * @param email The Email address of the tertiary recipient
  */
  void addBcc(const char *email)
  {
    struct esp_mail_smtp_recipient_address_t bcc;
    bcc.email = email;
    _bcc.push_back(bcc);
  };

  /** Add the custom header to the message
   *
   * @param hdr The header name and value
  */
  void addHeader(const char *hdr) { _hdr.push_back(hdr); };

  /* The message author config */
  struct esp_mail_email_info_t sender;

  /* The topic of message */
  const char *subject = "";

  /* The message type */
  byte type = esp_mail_msg_type_none;

  /* The PLAIN text message */
  struct esp_mail_plain_body_t text;

  /* The HTML text message */
  struct esp_mail_html_body_t html;

  /* The response config */
  struct esp_mail_smtp_msg_response_t response;

