bariscan-kose/Projects-Assignments/ESP32S Hospital SOSCode Microprocessor Project/Arduino/libraries/ESP-Mail-Client-master/src/ESP_Mail_Client.h
  /* The priority of the message */
  esp_mail_smtp_priority priority =
      esp_mail_smtp_priority::esp_mail_smtp_priority_normal;

  /* The enable options */
  struct esp_mail_smtp_enable_option_t enable;

  /* The message from config */
  struct esp_mail_email_info_t from;

  /* The message identifier */
  const char *messageID = "";

  /* The keywords or phrases, separated by commas */
  const char *keyword = "";

  /* The comment about message */
  const char *comment = "";

  /* The date of message */
  const char *date = "";

  /* The return recipient of the message */
  const char *return_path = "";

private:
  friend class ESP_Mail_Client;
  std::vector<struct esp_mail_smtp_recipient_t> _rcp = std::vector<struct esp_mail_smtp_recipient_t>();
  std::vector<struct esp_mail_smtp_recipient_address_t> _cc = std::vector<struct esp_mail_smtp_recipient_address_t>();
  std::vector<struct esp_mail_smtp_recipient_address_t> _bcc = std::vector<struct esp_mail_smtp_recipient_address_t>();
  std::vector<const char *> _hdr = std::vector<const char *>();
  std::vector<SMTP_Attachment> _att = std::vector<SMTP_Attachment>();
  std::vector<SMTP_Attachment> _parallel = std::vector<SMTP_Attachment>();
  std::vector<SMTP_Message> _rfc822 = std::vector<SMTP_Message>();
};

class SMTP_Status
{
public:
  friend class SMTPSession;
  friend class ESP_Mail_Client;

  SMTP_Status();
  ~SMTP_Status();
  const char *info();
  bool success();
  void empty();
  size_t completedCount();
  size_t failedCount();

private:
  std::string _info;
  bool _success = false;
  size_t _sentSuccess = 0;
  size_t _sentFailed = 0;
};

typedef void (*imapStatusCallback)(IMAP_Status);
typedef void (*smtpStatusCallback)(SMTP_Status);

class ESP_Mail_Client
{

public:
  /** Sending Email through the SMTP server
   *
   * @param smtp The pointer to SMTP session object which holds the data and the
   * TCP client.
   * @param msg The pointer to SMTP_Message class which contains the header,
   * body, and attachments.
   * @param closeSession The option to Close the SMTP session after sent.
   * @return The boolean value indicates the success of operation.
  */
  bool sendMail(SMTPSession *smtp, SMTP_Message *msg, bool closeSession = true);

  /** Reading Email through IMAP server.
   *
   * @param imap The pointer to IMAP sesssion object which holds the data and
   the TCP client.

   * @param closeSession The option to close the IMAP session after fetching or
   searching the Email.
   * @return The boolean value indicates the success of operation.
  */
  bool readMail(IMAPSession *imap, bool closeSession = true);

  /** Set the argument to the Flags for the specified message.
   *
   * @param imap The pointer to IMAP session object which holds the data and the
   * TCP client.
   * @param msgUID The UID of the message.
   * @param flags The flag list to set.
   * @param closeSession The option to close the IMAP session after set flag.
   * @return The boolean value indicates the success of operation.
  */
  bool setFlag(IMAPSession *imap, int msgUID, const char *flags, bool closeSession);

  /** Add the argument to the Flags for the specified message.
   *
   * @param imap The pointer to IMAP session object which holds the data and the
   * TCP client.
   * @param msgUID The UID of the message.
   * @param flags The flag list to set.
   * @param closeSession The option to close the IMAP session after add flag.
   * @return The boolean value indicates the success of operation.
  */
  bool addFlag(IMAPSession *imap, int msgUID, const char *flags, bool closeSession);

  /** Remove the argument from the Flags for the specified message.
   *
   * @param imap The pointer to IMAP session object which holds the data and the
   * TCP client.
   * @param msgUID The UID of the message that flags to be removed.
   * @param flags The flag list to remove.
   * @param closeSession The option to close the IMAP session after remove flag.
   * @return The boolean value indicates the success of operation.
  */
  bool removeFlag(IMAPSession *imap, int msgUID, const char *flags, bool closeSession);

  /** Initialize the SD card with the SPI port.
   *
   * @param sck The SPI Clock pin (ESP32 only).
   * @param miso The SPI MISO pin (ESSP32 only).
   * @param mosi The SPI MOSI pin (ESP32 only).
   * @param ss The SPI Chip/Slave Select pin (ESP32 and ESP8266).
   * @return The boolean value indicates the success of operation.
  */
  bool sdBegin(uint8_t sck, uint8_t miso, uint8_t mosi, uint8_t ss);

  /** Initialize the SD card with the default SPI port.
   *
   * @return The boolean value which indicates the success of operation.
  */
  bool sdBegin();

  /** Initialize the SD_MMC card (ESSP32 only).
  *
  * @param mountpoint The mounting point.
  * @param mode1bit Allow 1 bit data line.
  * @param format_if_mount_failed Format SD_MMC card if mount failed.
  * @return The boolean value indicates the success of operation.
  */
  bool sdMMCBegin(const char *mountpoint = "/sdcard", bool mode1bit = false, bool format_if_mount_failed = false);
  
  /** Get free Heap memory.
  *
  * @return Free memory amount in byte.
  */
  int getFreeHeap();

  ESPTimeHelper Time;


private:
  friend class SMTPSession;
  friend class IMAPSession;

  RFC2047_Decoder RFC2047Decoder;
  File file;

  bool _sdOk = false;
  bool _flashOk = false;
  bool _sdConfigSet = false;
  uint8_t _sck, _miso, _mosi, _ss;
  const char *sd_mmc_mountpoint = "";
  bool sd_mmc_mode1bit = false;
  bool sd_mmc_format_if_mount_failed = false;

#if defined(ESP8266)
  bool _clockReady = false;
  uint8_t _sdPin = SD_CS_PIN;
#endif

  unsigned long _lastReconnectMillis = 0;
  uint16_t _reconnectTimeout = ESP_MAIL_WIFI_RECONNECT_TIMEOUT;

  bool _sendMail(SMTPSession *smtp, SMTP_Message *msg, bool closeSession = true);
  bool ethLinkUp();
  bool reconnect(SMTPSession *smtp, unsigned long dataTime = 0);
  bool reconnect(IMAPSession *imap, unsigned long dataTime = 0, bool downloadRequestuest = false);
  void closeTCPSession(SMTPSession *smtp);
  void closeTCPSession(IMAPSession *imap);
  void getMIME(const char *ext, std::string &mime);
  void mimeFromFile(const char *name, std::string &mime);
#if defined(ESP32) || defined(ESP8266)
  void setSecure(TCP_CLIENT &tcpClient, ESP_Mail_Session *session, std::shared_ptr<const char> caCert);
#endif
  void delS(char *p);
  char *newS(size_t len);
  char *newS(char *p, size_t len);
  char *newS(char *p, size_t len, char *d);
  bool strcmpP(const char *buf, int ofs, PGM_P beginH);
  int strposP(const char *buf, PGM_P beginH, int ofs);
  char *strP(PGM_P pgm);
  void appendP(std::string &buf, PGM_P p, bool empty);
  char *intStr(int value);
  void errorStatusCB(SMTPSession *smtp, int error);
  size_t smtpSendP(SMTPSession *smtp, PGM_P v, bool newline = false);
  size_t smtpSend(SMTPSession *smtp, const char *data, bool newline = false);
  size_t smtpSend(SMTPSession *smtp, int data, bool newline = false);
  size_t smtpSend(SMTPSession *smtp, uint8_t *data, size_t size);
  bool getMultipartFechCmd(IMAPSession *imap, int msgIdx, std::string &partText);
  bool multipartMember(const std::string &part, const std::string &check);
  bool fetchMultipartBodyHeader(IMAPSession *imap, int msgIdx);
  bool connected(IMAPSession *imap);
  bool imapAuth(IMAPSession *imap);
  bool sendIMAPCommand(IMAPSession *imap, int msgIndex, int cmdCase);
  bool handleSMTPError(SMTPSession *smtp, int err, bool ret = false);
  void errorStatusCB(IMAPSession *imap, int error);
  size_t imapSendP(IMAPSession *imap, PGM_P v, bool newline = false);
  size_t imapSend(IMAPSession *imap, const char *data, bool nwline = false);
  size_t imapSend(IMAPSession *imap, int data, bool newline = false);
  std::string getBoundary(size_t len);
  std::string getEncodedToken(IMAPSession *imap);
  bool imapLogout(IMAPSession *imap);
  bool sendParallelAttachments(SMTPSession *smtp, SMTP_Message *msg, const std::string &boundary);
  bool sendAttachments(SMTPSession *smtp, SMTP_Message *msg, const std::string &boundary, bool parallel = false);

  bool sendMSGData(SMTPSession *smtp, SMTP_Message *msg, bool closeSession, bool rfc822MSG);
  bool sendRFC822Msg(SMTPSession *smtp, SMTP_Message *msg, const std::string &boundary, bool closeSession, bool rfc822MSG);
  void getRFC822MsgEnvelope(SMTPSession *smtp, SMTP_Message *msg, std::string &buf);
  bool bdat(SMTPSession *smtp, SMTP_Message *msg, int len, bool last);
  void checkBinaryData(SMTPSession *smtp, SMTP_Message *msg);
  bool sendBlob(SMTPSession *smtp, SMTP_Message *msg, SMTP_Attachment *att);
  bool sendFile(SMTPSession *smtp, SMTP_Message *msg, SMTP_Attachment *att, File &file);
  bool openFileRead(SMTPSession *smtp, SMTP_Message *msg, SMTP_Attachment *att, File &file, std::string &s, std::string &buf, const std::string &boundary, bool inlined);
  bool openFileRead2(SMTPSession *smtp, SMTP_Message *msg, File &file, const char *path, esp_mail_file_storage_type storageType);
  bool sendInline(SMTPSession *smtp, SMTP_Message *msg, const std::string &boundary, byte type);
  void debugInfoP(PGM_P info);
  size_t numAtt(SMTPSession *smtp, esp_mail_attach_type type, SMTP_Message *msg);
  bool validEmail(const char *s);
  bool checkEmail(SMTPSession *smtp, SMTP_Message *msg);
  bool sendPartText(SMTPSession *smtp, SMTP_Message *msg, byte type, const char *boundary);
  char *getUID();
  bool sendBlobBody(SMTPSession *smtp, SMTP_Message *msg, uint8_t type);
  bool sendFileBody(SMTPSession *smtp, SMTP_Message *msg, uint8_t type);
  void encodingText(SMTPSession *smtp, SMTP_Message *msg, uint8_t type, std::string &content);
  void splitTk(std::string &str, std::vector<std::string> &tk, const char *delim);
  void formatFlowedText(std::string &content);
  void softBreak(std::string &content, const char *quoteMarks);
  bool sendMSG(SMTPSession *smtp, SMTP_Message *msg, const std::string &boundary);
  void getAttachHeader(std::string &header, const std::string &boundary, SMTP_Attachment *attach, size_t size);
  void getRFC822PartHeader(SMTPSession *smtp, std::string &header, const std::string &boundary);
  void getInlineHeader(std::string &header, const std::string &boundary, SMTP_Attachment *inlineAttach, size_t size);
  unsigned char *decodeBase64(const unsigned char *src, size_t len, size_t *out_len);
  std::string encodeBase64Str(const unsigned char *src, size_t len);
  std::string encodeBase64Str(uint8_t *src, size_t len);
  void encodeQP(const char *buf, char *out);
  bool sendBase64(SMTPSession *smtp, SMTP_Message *msg, const unsigned char *data, size_t len, bool flashMem, const char *filename, bool report);
  bool sendBase64Raw(SMTPSession *smtp, SMTP_Message *msg, const uint8_t *data, size_t len, bool flashMem, const char *filename, bool report);
  bool sendBase64Stream(SMTPSession *smtp, SMTP_Message *msg, File file, const char *filename, bool report);
  bool sendBase64StreamRaw(SMTPSession *smtp, SMTP_Message *msg, File file, const char *filename, bool report);
  void smtpCBP(SMTPSession *smtp, PGM_P info, bool success = false);
  void smtpCB(SMTPSession *smtp, const char *info, bool success = false);
  void imapCBP(IMAPSession *imap, PGM_P info, bool success);
  void imapCB(IMAPSession *imap, const char *info, bool success);
  int readLine(WiFiClient *stream, char *buf, int bufLen, bool crlf, int &count);
  int getMSGNUM(IMAPSession *imap, char *buf, int bufLen, int &chunkIdx, bool &endSearch, int &nump, const char *key, const char *pc);
  void handleHeader(IMAPSession *imap, char *buf, int bufLen, int &chunkIdx, struct esp_mail_message_header_t &header, int &headerState, int &octetCount);
  void setHeader(IMAPSession *imap, char *buf, struct esp_mail_message_header_t &header, int state);
  void handlePartHeader(IMAPSession *imap, char *buf, int &chunkIdx, struct esp_mail_message_part_info_t &part);
  char *subStr(const char *buf, PGM_P beginH, PGM_P endH, int beginPos, int endPos = 0);
  struct esp_mail_message_part_info_t *cPart(IMAPSession *imap);
  struct esp_mail_message_header_t *cHeader(IMAPSession *imap);
  void strcat_c(char *str, char c);
  int strpos(const char *haystack, const char *needle, int offset);
  char *stristr(const char *str1, const char *str2);
  char *rstrstr(const char *haystack, const char *needle);
  int rstrpos(const char *haystack, const char *needle, int offset);
  void getResponseStatus(const char *buf, esp_mail_smtp_status_code respCode, int beginPos, struct esp_mail_smtp_response_status_t &status);
  void handleAuth(SMTPSession *smtp, char *buf);
  std::string getEncodedToken(SMTPSession *smtp);
  bool connected(SMTPSession *smtp);
  bool setSendingResult(SMTPSession *smtp, SMTP_Message *msg, bool result);
  bool smtpAuth(SMTPSession *smtp);
  int available(SMTPSession *smtp);
  bool handleSMTPResponse(SMTPSession *smtp, esp_mail_smtp_status_code respCode, int errCode);
  int available(IMAPSession *imap);
  bool handleIMAPResponse(IMAPSession *imap, int errCode, bool closeSession);
  void downloadReport(IMAPSession *imap, int progress);
  void fetchReport(IMAPSession *imap, int progress, bool html);
  void searchReport(int progress, const char *percent);
  void uploadReport(const char *filename, int progress);
  int cMSG(IMAPSession *imap);
  int cIdx(IMAPSession *imap);
  esp_mail_imap_response_status imapResponseStatus(IMAPSession *imap, char *response);
  void saveHeader(IMAPSession *imap);
  esp_mail_char_decoding_scheme getEncodingFromCharset(const char *enc);
  void decodeHeader(std::string &headerField, std::string &headerEnc);
  bool handleAttachment(IMAPSession *imap, char *buf, int bufLen, int &chunkIdx, File &file, std::string &filePath, bool &downloadRequest, int &octetCount, int &octetLength, int &oCount, int &reportState, int &downloadCount);
  int decodeLatin1_UTF8(unsigned char *out, int *outlen, const unsigned char *in, int *inlen);
  void decodeTIS620_UTF8(char *out, const char *in, size_t len);
  void decodeText(IMAPSession *imap, char *buf, int bufLen, int &chunkIdx, File &file, std::string &filePath, bool &downloadRequest, int &octetLength, int &readDataLen, int &readCount);
  void prepareFilePath(IMAPSession *imap, std::string &filePath, bool header);
  int decodeChar(const char *s);
  void decodeQP(const char *buf, char *out);
  char *decode7Bit(char *buf);
  char *strReplace(char *orig, char *rep, char *with);
  char *strReplaceP(char *buf, PGM_P key, PGM_P value);
  bool authFailed(char *buf, int bufLen, int &chunkIdx, int ofs);
  void handleFolders(IMAPSession *imap, char *buf);
  void handleCapability(IMAPSession *imap, char *buf, int &chunkIdx);
  void handleExamine(IMAPSession *imap, char *buf);
  bool handleIMAPError(IMAPSession *imap, int err, bool ret);
  bool _setFlag(IMAPSession *imap, int msgUID, const char *flags, uint8_t action, bool closeSession);
  void createDirs(std::string dirs);
  bool sdTest();
};

class IMAPSession
{
public:
  IMAPSession();
  ~IMAPSession();

  /** Begin the IMAP server connection.
   *
   * @param session The pointer to ESP_Mail_Session structured data that keeps
   * the server and log in details.
   * @param config The pointer to IMAP_Config structured data that keeps the
   * operation options.
   * @return The boolean value which indicates the success of operation.
  */
  bool connect(ESP_Mail_Session *session, IMAP_Config *config);

  /** Close the IMAP session.
   *
   * @return The boolean value which indicates the success of operation.
  */
  bool closeSession();

